
#pragma once

#include "ShevArray.h"
#include "Vector3d.h"

namespace Shev
{
    class Polyhedron;
}

using namespace Shev;


//**************************** 28.08.2003 *********************************//
//
//              Минимальная сфера вокруг данных точек
//
//**************************** 10.11.2010 *********************************//

Def<Sphere3d> minSphereAroundPoints ( CArrRef<Vector3d> data );


//**************************** 6.11.2010 *********************************//
//
//              Минимальная сфера вокруг данных сфер
//
//**************************** 16.11.2010 *********************************//

Def<Sphere3d> minSphereAroundSpheres ( CArrRef<Sphere3d> data );


//**************************** 17.04.2010 *********************************//
//
//      Минимальная сфера пересекающая все заданные плоскости
//
//**************************** 17.04.2010 *********************************//

Def<Sphere3d> minSphere ( CArrRef<Plane3d> data );


//**************************** 07.03.2012 *********************************//
//
//      Минимальная сфера пересекающая все заданные прямые
//
//**************************** 07.03.2012 *********************************//

Def<Sphere3d> minSphere ( CArrRef<Line3d> data );


//**************************** 10.10.2009 *********************************//
//
//          Минимальный по объёму охватывающий эллипсоид
//
//**************************** 17.10.2009 *********************************//

Def<Ellipsoid3d> minEllipsoidV ( CArrRef<Vector3d> points );


//**************************** 02.05.2013 *********************************//
//
//      Цилиндр с минимальным радиусом охватывающий данные точки
//
//**************************** 02.05.2013 *********************************//

Def<Cylinder3d> minCylinderR ( CArrRef<Vector3d> data );


//**************************** 09.05.2016 *********************************//
//
//  Минимальный правильный тетраэдр охватывающий данные точки без вращения
//
//**************************** 14.09.2019 *********************************//

bool minRegularTetrahedronAroundPointsNR ( CCArrRef<Vector3d> & data, const Ortho3d & ortho, Polyhedron & poly );


//**************************** 14.09.2019 *********************************//
//
//      Минимальный правильный тетраэдр охватывающий данные точки
//
//**************************** 14.09.2019 *********************************//

bool minRegularTetrahedronAroundPoints ( CCArrRef<Vector3d> & data, Polyhedron & poly );


//**************************** 28.05.2016 *********************************//
//
//              Минимальный прямоугольный параллелепипед 
//              охватывающий данные точки без вращения
//
//**************************** 28.05.2016 *********************************//

Def<Cuboid3d> minCuboidAroundPointsNR ( CArrRef<Vector3d> data );


//**************************** 11.02.2010 *********************************//
//
//         Минимальный по объёму прямоугольный параллелепипед 
//              охватывающий выпуклый многогранник
//
//**************************** 22.11.2010 *********************************//

Def<Cuboid3d> minCuboidAroundConvexPolyhedronV ( const Polyhedron & inner );


//**************************** 11.02.2010 *********************************//
//
//         Минимальный по площади прямоугольный параллелепипед 
//              охватывающий выпуклый многогранник
//
//**************************** 23.11.2010 *********************************//

Def<Cuboid3d> minCuboidAroundConvexPolyhedronA ( const Polyhedron & inner );


//**************************** 09.03.2007 *********************************//
//
//          Максимальная сфера вписанная в выпуклый многогранник
//          dim - габариты многогранника
//          plane - массив указателей на плоскости граней
//
//**************************** 16.11.2011 *********************************//

Def<Sphere3d> maxSphereInConvexPolyhedron ( const Segment3d & dim, CArrRef<const Plane3d *> plane, ArrRef<nat> index );
Def<Sphere3d> maxSphereInConvexPolyhedron ( const Segment3d & dim, CArrRef<const Plane3d *> plane );
Def<Sphere3d> maxSphereInConvexPolyhedron ( const Segment3d & dim, CArrRef<Plane3d> plane, ArrRef<nat> index );
Def<Sphere3d> maxSphereInConvexPolyhedron ( const Segment3d & dim, CArrRef<Plane3d> plane );
Def<Sphere3d> maxSphereInConvexPolyhedron ( const Polyhedron & poly );


//**************************** 08.08.2010 *********************************//
//
//    Максимальный фиксированный цилиндр вписанный в выпуклый многогранник
//    ext - отношение высоты цилиндра к его диаметру
//
//**************************** 14.08.2010 *********************************//

Def<Cylinder3d> maxFixCylinderInConvexPolyhedron ( const Polyhedron & poly, double ext );


//**************************** 14.08.2010 *********************************//
//
//    Максимальный фиксированный конус вписанный в выпуклый многогранник
//    ext - отношение высоты конуса к его диаметру
//
//**************************** 14.08.2010 *********************************//

Def<Cone3d> maxFixConeInConvexPolyhedron ( const Polyhedron & poly, double ext );


//**************************** 18.08.2010 *********************************//
//
//    Максимальный фиксированный круговой эллипсоид 
//         вписанный в выпуклый многогранник
//    ext - отношение неравных диаметров эллипсоида
//
//**************************** 18.08.2010 *********************************//

Def<Ellipsoid3d> maxFixSpheroidInConvexPolyhedron ( const Polyhedron & poly, double ext );


//**************************** 24.08.2012 *********************************//
//
//     Максимальный по объёму цилиндр вписанный в выпуклый многогранник
//
//**************************** 24.08.2012 *********************************//

Def<Cylinder3d> maxCylinderInConvexPolyhedronV ( const Polyhedron & poly );


//**************************** 24.08.2012 *********************************//
//
//     Максимальный по объёму конус вписанный в выпуклый многогранник
//
//**************************** 24.08.2012 *********************************//

Def<Cone3d> maxConeInConvexPolyhedronV ( const Polyhedron & poly );


//**************************** 24.08.2012 *********************************//
//
//    Максимальный по объёму сфероид вписанный в выпуклый многогранник
//
//**************************** 24.08.2012 *********************************//

Def<Ellipsoid3d> maxSpheroidInConvexPolyhedronV ( const Polyhedron & poly );


//**************************** 21.11.2013 *********************************//
//
//      Максимальный по объёму эллипсоид вписанный в тетраэдр
//
//**************************** 21.11.2013 *********************************//

Ellipsoid3d maxEllipsoidInTetrahedronV ( Vector3d v1, Vector3d v2, Vector3d v3, Vector3d v4 );


//**************************** 01.02.2017 *********************************//
//
//   Максимальный по объёму эллипсоид вписанный в выпуклый многоугольник
//
//**************************** 01.02.2017 *********************************//

Def<Ellipsoid3d> maxEllipsoidInConvexPolyhedronV ( const Polyhedron & poly );


//**************************** 05.02.2023 *********************************//
//
//          Максимальный тетраэдр вписанный в выпуклый многогранник
//
//**************************** 05.02.2023 *********************************//

Def<Tetrahedron> maxTetrahedronInConvexPolyhedronV ( const Polyhedron & poly );


//**************************** 24.10.2021 *********************************//
//
//      Максимальный по объёму прямоугольный параллелепипед
//        вписанный в выпуклый многогранник без вращения
//
//**************************** 24.10.2021 *********************************//

Def<Cuboid3d> maxCuboidInConvexPolyhedronNR ( const Polyhedron & poly, const Spin3d & spin = Spin3d() );


//**************************** 03.05.2014 *********************************//
//
// Максимальный многогранник вписанный в выпуклый многогранник без вращения
//
//**************************** 03.05.2014 *********************************//

Def<Conform3d> maxPolyhedronInConvexPolyhedronNR ( const Polyhedron & inner, const Polyhedron & outer );


//**************************** 30.03.2015 *********************************//
//
//     Максимальный многогранник вписанный в выпуклый многогранник 
//               с вращением вокруг заданной оси
//
//**************************** 24.02.2023 *********************************//

Def<Conform3d> maxPolyhedronInConvexPolyhedron1R ( const Polyhedron & inner, 
                                                   const Vector3d & az, nat sym,
                                                   const Polyhedron & outer );


//**************************** 31.07.2019 *********************************//
//
//     Максимальный многогранник вписанный в выпуклый многогранник 
//
//**************************** 31.07.2019 *********************************//

Def<Conform3d> maxPolyhedronInConvexPolyhedron ( const Polyhedron & inner, const Polyhedron & outer );