
#pragma once

#include "template.h"
#include "Vector3d.h"

namespace Shev
{
    class Polyhedron;
}

using namespace Shev;


//**************************** 29.11.2017 *********************************//
//
//      Максимальный круг вписанный в выпуклый многогранник
//
//**************************** 29.11.2017 *********************************//

Def<Circle3d> maxCircleInConvexPolyhedron ( const Polyhedron & poly );


//**************************** 01.10.2019 *********************************//
//
//      Максимальный свободный эллипс вписанный в треугольник
//                      A - максимум площади 
//
//**************************** 01.10.2019 *********************************//

Def<Ellipse3d> maxEllipseInTriangleA ( Vector3d p1, Vector3d p2, Vector3d p3 );


//**************************** 01.10.2019 *********************************//
//
//        Максимальный свободный эллипс вписанный в тетраэдр
//                      A - максимум площади 
//
//**************************** 01.10.2019 *********************************//

Def<Ellipse3d> maxEllipseInTetrahedronA ( Vector3d p1, Vector3d p2, Vector3d p3, Vector3d p4 );


//**************************** 08.07.2018 *********************************//
//
//      Максимальный треугольник вписанный в выпуклый многогранник
//
//**************************** 08.07.2018 *********************************//

Def<Triangle3d> maxTriangleInConvexPolyhedronA ( const Polyhedron & poly );


//**************************** 08.10.2018 *********************************//
//
//       Максимальный прямоугольник вписанный в выпуклый многогранник
//                            без вращения
//
//**************************** 08.10.2018 *********************************//

Def<Rectangle3d> maxRectangleInConvexPolyhedronANR ( const Polyhedron & outer );


//**************************** 16.08.2020 *********************************//
//
//      Максимальный прямоугольник вписанный в выпуклый многогранник
//                      A - максимум площади 
//
//**************************** 16.08.2020 *********************************//

Def<Rectangle3d> maxRectangleInConvexPolyhedronA ( const Polyhedron & outer );


//**************************** 08.10.2018 *********************************//
//
//         Максимальный ромб вписанный в выпуклый многогранник
//                            без вращения
//
//**************************** 08.10.2018 *********************************//

Def<Rhombus3d> maxRhombusInConvexPolyhedronANR ( const Polyhedron & outer );


//**************************** 16.08.2020 *********************************//
//
//          Максимальный ромб вписанный в выпуклый многогранник
//                      A - максимум площади 
//
//**************************** 16.08.2020 *********************************//

Def<Rhombus3d> maxRhombusInConvexPolyhedronA ( const Polyhedron & outer );


//**************************** 08.04.2018 *********************************//
//
//      Максимальный параллелограмм вписанный в выпуклый многогранник
//              A - максимум площади, P - максимум периметра 
//
//**************************** 16.12.2018 *********************************//

Def<Parallelogram3d> maxParallelogramInConvexPolyhedronA ( const Polyhedron & poly );
Def<Parallelogram3d> maxParallelogramInConvexPolyhedronP ( const Polyhedron & poly );

