
#pragma once

#include "ShevArray.h"

//*********************** 30.08.2006 **************************//
//
//          Порядковые статистики ( 0 <= i < a.size() )
//
//*********************** 29.08.2011 **************************//

Def<double> select7 ( CArrRef<double> a, nat i );


//*********************** 09.01.2015 **************************//
//
//              Сглаженные порядковые статистики
//              0 <= p <= 1
//              r - радиус окна усреднения
//              Прямоугольная функция сглаживания
//
//*********************** 09.01.2015 **************************//

Def<double> selectS ( ArrRef<SortItem<double> > s, double p, double r );


//*********************** 06.03.2015 **************************//
//
//              Сглаженные порядковые статистики
//              0 <= p <= 1
//              r - радиус окна усреднения
//              Треугольная функция сглаживания
//
//*********************** 06.03.2015 **************************//

Def<double> selectT ( ArrRef<SortItem<double> > s, double p, double r );

